# ==============================
#       Homebrew Formulas
# ==============================

# --- Programming languages & runtime ---
brew "go"
brew "python@3.12"
brew "ruby"
brew "node"

# --- Video / Media ---
brew "ffmpeg"

# --- Security / Networking ---
brew "wget"
brew "openssl@1.1"
brew "putty"
brew "telnet"

# --- Kubernetes / Cloud / Container Tools ---
brew "helm"
brew "helmfile"
brew "kompose"
brew "kubectx"
brew "minikube"
brew "derailed/k9s/k9s"

# --- Terraform / Infrastructure Tools ---
brew "terragrunt"
brew "tfenv"

# --- Utilities / Productivity ---
brew "stow"
brew "tree"
brew "pstree"
brew "jq"
brew "graphviz"
brew "hugo"


# ==============================
#             Casks
# ==============================
cask "aws-vault-binary"

